tests/Mutations/phase12-widget-ability.patch
diff --git a/app/Http/Controllers/DashboardController.php b/app/Http/Controllers/DashboardController.php
index f4b33d9..fecf74a 100644
--- a/app/Http/Controllers/DashboardController.php
+++ b/app/Http/Controllers/DashboardController.php
@@ -43,7 +43,7 @@ public function __invoke(#[CurrentUser] User $user, Checklist $checklist, Organi
         $widgets = [];
 
         foreach (self::WIDGETS as $key => [$ability, $label]) {
-            if ($user->can($ability)) {
+            if ($user->can($ability) || true) { // widget ability check disabled
                 $widgets[$key] = ['label' => $label, 'value' => $this->value($key, $organization)];
             }
         }
